Config/Documents/ВводИсторииКапвложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВводИсторииКапвложений</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ИсторияКапвложений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийВводИсторииКапвложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоАгрегаторДвижений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияОпераций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектВложений</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОбъектКапвложений</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КарточкаКапвложений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КарточкиКапвложений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетВложения</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПССчетВложения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭКСчетВложения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦМОСчетВложения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКорр</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПССчетКорр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭКСчетКорр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоСчетКорр1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоСчетКорр2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоСчетКорр3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОперации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СторонаСчетВложения</Name>
							<Comment>Счет вложений по дебету или кредиту</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>254</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПервичногоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПервичногоДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПервичногоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаВложений</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаДвиженияКорр</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/AccumulationRegisters/ИсторияКапвложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ИсторияКапвложений</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетВложения</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПССчетВложения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КЭКСчетВложения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦМОСчетВложения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКорр</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПССчетКорр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КЭКСчетКорр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоСчетКорр1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоСчетКорр2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоСчетКорр3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОперации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СторонаСчетВложения</Name>
					<Comment>Счет вложений по дебету или кредиту</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияКорр</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектВложений</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектКапвложений</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КарточкаКапвложений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КарточкиКапвложений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Config/InformationRegisters/ОперацииКапвложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОперацииКапвложений</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументКапвложений</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыСПроводкамиПоКапвложениям</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КарточкаКапвложений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КарточкиКапвложений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/ВидыОперацийВводИсторииКапвложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийВводИсторииКапвложений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводКарточекКапвложенийПоОстаткам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводИсторииКарточекКапвложений</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/ВводИсторииКапвложений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры
// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ВводИсторииКапвложений";
	КомандаПечати.Идентификатор		= "КарточкаДокумента_ВводИсторииКапвложений";
	КомандаПечати.Представление		= НСтр("ru = 'Карточка документа ""Ввод истории капвложений""'");
	КомандаПечати.Порядок			= 1;
    
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов - Массив - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати - СписокЗначений - Соответствие между объектами и именами печатных областей, куда распечатан объект
//   ИменаМакетов - Строка - Имена макетов, перечисленные через запятую
//   ПараметрыВывода - Структура - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КарточкаДокумента_ВводИсторииКапвложений") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
		"КарточкаДокумента_ВводИсторииКапвложений", 
		НСтр("ru = 'Карточка документа ""Ввод истории капвложений""'"), 
		ПечатьКарточкиИстории(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры

// Формирует таблицы движений документа для разных регистров, по которым документ должен сформировать движения.
// Это предопределенная процедура в механизме формирования движений.
//
// Параметры:
//	ДокументСсылка - ДокументСсылка - ссылка на документ, который формирует движения
//	СтруктураДополнительныеСвойства - Структура - это свойство "ДополнительныеСвойства" ДокументаОбъекта
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;              
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	НомераТаблиц = Новый Структура;
	
	ИнициализироватьЗапросПоДокументу(Запрос, НомераТаблиц);
	
	Результат = Запрос.ВыполнитьПакет();                                     
	ОбщегоНазначенияБГУ.ВыгрузитьТаблицыЗапроса(СтруктураДополнительныеСвойства.ТаблицыДляДвижений, Результат, НомераТаблиц);
	
КонецПроцедуры                                             

// Формирует таблицу с данными карточек капвложений на дату. Таблица формируется по данным
// регистра бухгалтерии за вычетом движений, которые уже перенесены в регистр накопления "ИсторияКапвложений". 
//
// Параметры:
//	ДатаЗапроса - Дата
//	Организация - СправочникСсылка.Организации - элемент справочника "Организации" для отбора
//				- Массив Из СправочникСсылка.Организации - массив элементов справочника "Организации" для отбора
//	СИтогамиДляСтаройСвертки - Булево - для корректной работы старой обработки свертки, нужна группировка по итогам по 
//										Организациям и Активности. Для вызова из старой свертки нужно передавать значение Истина.
//
// Возвращаемое значение:
//	- Запрос - запрос с установленными параметрами по получению данных для формирования движений в регистр накопления "ИсторияКапвложений"
Функция Запрос_ТаблицаИсторииКапвложений(ДатаЗапроса, Организации = Неопределено, СИтогамиДляСтаройСвертки = Ложь) Экспорт
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ИсторияКапвложений.Период) КАК Период,
	|	ИсторияКапвложений.КарточкаКапвложений КАК КарточкаКапвложений
	|ПОМЕСТИТЬ КарточкиВРегистреИстории
	|ИЗ
	|	РегистрНакопления.ИсторияКапвложений КАК ИсторияКапвложений
	|ГДЕ
	|	ИсторияКапвложений.Период <= &Дата1
	|	И (&НетОтбораПоОрганизации
	|			ИЛИ ИсторияКапвложений.Организация В (&Организации))
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсторияКапвложений.КарточкаКапвложений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОперацииКапвложений.Регистратор КАК Регистратор,
	|	ОперацииКапвложений.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ОперацииКапвложений.Регистратор) = ТИП(Документ.РегистрацияКапвложений)
	|			ТОГДА ОперацииКапвложений.ДокументКапвложений
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ДокументКапвложений,
	|	ОперацииКапвложений.КарточкаКапвложений КАК КарточкаКапвложений,
	|	ОперацииКапвложений.КарточкаКапвложений.ОбъектВложений КАК ОбъектВложений,
	|	ОперацииКапвложений.КарточкаКапвложений.Владелец КАК Организация
	|ПОМЕСТИТЬ Регистраторы1
	|ИЗ
	|	РегистрСведений.ОперацииКапвложений КАК ОперацииКапвложений
	|ГДЕ
	|	ОперацииКапвложений.Период <= &Дата1
	|	И (&НетОтбораПоОрганизации
	|			ИЛИ ОперацииКапвложений.Организация В (&Организации))
	|
	|СГРУППИРОВАТЬ ПО
	|	ОперацииКапвложений.Регистратор,
	|	ОперацииКапвложений.Период,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ОперацииКапвложений.Регистратор) = ТИП(Документ.РегистрацияКапвложений)
	|			ТОГДА ОперацииКапвложений.ДокументКапвложений
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ОперацииКапвложений.КарточкаКапвложений,
	|	ОперацииКапвложений.КарточкаКапвложений.ОбъектВложений,
	|	ОперацииКапвложений.КарточкаКапвложений.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЖурналПроводокЕПСБУ.Регистратор КАК ОперацияБух
	|ПОМЕСТИТЬ ОперацииБухАктивные
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ КАК ЖурналПроводокЕПСБУ
	|ГДЕ
	|	ЖурналПроводокЕПСБУ.Период <= &Дата1
	|	И ЖурналПроводокЕПСБУ.Активность
	|	И ЖурналПроводокЕПСБУ.Регистратор В
	|			(ВЫБРАТЬ
	|				Регистраторы1.ДокументКапвложений КАК Регистратор
	|			ИЗ
	|				Регистраторы1 КАК Регистраторы1
	|			ГДЕ
	|				ТИПЗНАЧЕНИЯ(Регистраторы1.Регистратор) = ТИП(Документ.РегистрацияКапвложений)
	|				И ТИПЗНАЧЕНИЯ(Регистраторы1.ДокументКапвложений) = ТИП(Документ.ОперацияБух))
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖурналПроводокЕПСБУ.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Регистраторы1.Регистратор) = ТИП(Документ.РегистрацияКапвложений)
	|			ТОГДА Регистраторы1.ДокументКапвложений
	|		ИНАЧЕ Регистраторы1.Регистратор
	|	КОНЕЦ КАК Регистратор,
	|	Регистраторы1.КарточкаКапвложений КАК КарточкаКапвложений,
	|	Регистраторы1.КарточкаКапвложений.ОбъектВложений КАК ОбъектВложений,
	|	Регистраторы1.КарточкаКапвложений.Владелец КАК Организация
	|ПОМЕСТИТЬ Регистраторы
	|ИЗ
	|	Регистраторы1 КАК Регистраторы1
	|		ЛЕВОЕ СОЕДИНЕНИЕ КарточкиВРегистреИстории КАК КарточкиВРегистреИстории
	|		ПО Регистраторы1.КарточкаКапвложений = КарточкиВРегистреИстории.КарточкаКапвложений
	|			И Регистраторы1.Период <= КарточкиВРегистреИстории.Период
	|ГДЕ
	|	КарточкиВРегистреИстории.КарточкаКапвложений ЕСТЬ NULL
	|	И ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(Регистраторы1.Регистратор) = ТИП(Документ.РегистрацияКапвложений)
	|				ТОГДА ВЫБОР
	|						КОГДА ТИПЗНАЧЕНИЯ(Регистраторы1.ДокументКапвложений) = ТИП(Документ.ОперацияБух)
	|							ТОГДА Регистраторы1.ДокументКапвложений В
	|									(ВЫБРАТЬ
	|										ОперацииБухАктивные.ОперацияБух
	|									ИЗ
	|										ОперацииБухАктивные)
	|						ИНАЧЕ Регистраторы1.ДокументКапвложений.Проведен
	|					КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Регистраторы1.Регистратор) = ТИП(Документ.РегистрацияКапвложений)
	|			ТОГДА Регистраторы1.ДокументКапвложений
	|		ИНАЧЕ Регистраторы1.Регистратор
	|	КОНЕЦ,
	|	Регистраторы1.КарточкаКапвложений,
	|	Регистраторы1.КарточкаКапвложений.ОбъектВложений,
	|	Регистраторы1.КарточкаКапвложений.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Организация КАК Организация,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1 КАК ОбъектВложений,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2 КАК ЦМОСчетВложения,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ПодразделениеДт КАК Подразделение,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО КАК КФО,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт КАК СчетВложения,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт КАК КПССчетВложения,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭКДт КАК КЭКСчетВложения,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт КАК СчетКорр,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт КАК КПССчетКорр,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт КАК КЭКСчетКорр,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК СубконтоСчетКорр1,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 КАК СубконтоСчетКорр2,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 КАК СубконтоСчетКорр3,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Период КАК ДатаОперации,
	|	""Дт"" КАК СторонаСчетВложения,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Содержание КАК Содержание,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ВидПервичногоДокумента КАК ВидПервичногоДокумента,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ДатаПервичногоДокумента КАК ДатаПервичногоДокумента,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.НомерПервичногоДокумента КАК НомерПервичногоДокумента,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоДт КАК Количество,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Сумма КАК Сумма,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Регистратор,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ХарактеристикаДвиженияКт КАК ХарактеристикаДвиженияКорр
	|ПОМЕСТИТЬ ТабПроводок
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|			,
	|			&Дата1,
	|			СчетДт В (&СчетаКапвложений)
	|				И СубконтоДт1 В
	|					(ВЫБРАТЬ
	|						Таб.ОбъектВложений
	|					ИЗ
	|						Регистраторы КАК Таб)
	|				И Регистратор В
	|					(ВЫБРАТЬ
	|						Таб.Регистратор
	|					ИЗ
	|						Регистраторы КАК Таб)
	|				И (&НетОтбораПоОрганизации
	|					ИЛИ Организация В (&Организации)),
	|			,
	|			) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Организация,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ПодразделениеКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭКДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Период,
	|	""Кт"",
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Содержание,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ВидПервичногоДокумента,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ДатаПервичногоДокумента,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.НомерПервичногоДокумента,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Сумма,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ХарактеристикаДвиженияДт
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|			,
	|			&Дата1,
	|			СчетКт В (&СчетаКапвложений)
	|				И СубконтоКт1 В
	|					(ВЫБРАТЬ
	|						Таб.ОбъектВложений
	|					ИЗ
	|						Регистраторы КАК Таб)
	|				И Регистратор В
	|					(ВЫБРАТЬ
	|						Таб.Регистратор
	|					ИЗ
	|						Регистраторы КАК Таб)
	|				И (&НетОтбораПоОрганизации
	|					ИЛИ Организация В (&Организации)),
	|			,
	|			) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	ТабПроводок.Организация КАК Организация,
	|	Регистраторы.КарточкаКапвложений КАК КарточкаКапвложений,
	|	ТабПроводок.ОбъектВложений КАК ОбъектВложений,
	|	ТабПроводок.Подразделение КАК Подразделение,
	|	ТабПроводок.КФО КАК КФО,
	|	ТабПроводок.СчетВложения КАК СчетВложения,
	|	ТабПроводок.КПССчетВложения КАК КПССчетВложения,
	|	ТабПроводок.КЭКСчетВложения КАК КЭКСчетВложения,
	|	ТабПроводок.ЦМОСчетВложения КАК ЦМОСчетВложения,
	|	ТабПроводок.СчетКорр КАК СчетКорр,
	|	ТабПроводок.КПССчетКорр КАК КПССчетКорр,
	|	ТабПроводок.КЭКСчетКорр КАК КЭКСчетКорр,
	|	ТабПроводок.СубконтоСчетКорр1 КАК СубконтоСчетКорр1,
	|	ТабПроводок.СубконтоСчетКорр2 КАК СубконтоСчетКорр2,
	|	ТабПроводок.СубконтоСчетКорр3 КАК СубконтоСчетКорр3,
	|	ТабПроводок.ДатаОперации КАК ДатаОперации,
	|	ТабПроводок.СторонаСчетВложения КАК СторонаСчетВложения,
	|	ТабПроводок.Содержание КАК Содержание,
	|	ТабПроводок.ВидПервичногоДокумента КАК ВидПервичногоДокумента,
	|	ТабПроводок.ДатаПервичногоДокумента КАК ДатаПервичногоДокумента,
	|	ТабПроводок.НомерПервичногоДокумента КАК НомерПервичногоДокумента,
	|	ТабПроводок.ХарактеристикаДвиженияКорр КАК ХарактеристикаДвиженияКорр,
	|	ТабПроводок.Количество КАК Количество,
	|	ТабПроводок.Сумма КАК Сумма
	|ПОМЕСТИТЬ ТабДвижений
	|ИЗ
	|	Регистраторы КАК Регистраторы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабПроводок КАК ТабПроводок
	|		ПО Регистраторы.Регистратор = ТабПроводок.Регистратор
	|			И Регистраторы.ОбъектВложений = ТабПроводок.ОбъектВложений
	|			И Регистраторы.Организация = ТабПроводок.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	ИсторияКапвложений.Организация,
	|	ИсторияКапвложений.КарточкаКапвложений,
	|	ИсторияКапвложений.ОбъектВложений,
	|	ИсторияКапвложений.Подразделение,
	|	ИсторияКапвложений.КФО,
	|	ИсторияКапвложений.СчетВложения,
	|	ИсторияКапвложений.КПССчетВложения,
	|	ИсторияКапвложений.КЭКСчетВложения,
	|	ИсторияКапвложений.ЦМОСчетВложения,
	|	ИсторияКапвложений.СчетКорр,
	|	ИсторияКапвложений.КПССчетКорр,
	|	ИсторияКапвложений.КЭКСчетКорр,
	|	ИсторияКапвложений.СубконтоСчетКорр1,
	|	ИсторияКапвложений.СубконтоСчетКорр2,
	|	ИсторияКапвложений.СубконтоСчетКорр3,
	|	ИсторияКапвложений.ДатаОперации,
	|	ИсторияКапвложений.СторонаСчетВложения,
	|	ИсторияКапвложений.Содержание,
	|	ИсторияКапвложений.ВидПервичногоДокумента,
	|	ИсторияКапвложений.ДатаПервичногоДокумента,
	|	ИсторияКапвложений.НомерПервичногоДокумента,
	|	ИсторияКапвложений.ХарактеристикаДвиженияКорр,
	|	ИсторияКапвложений.Количество,
	|	ИсторияКапвложений.Сумма
	|ИЗ
	|	РегистрНакопления.ИсторияКапвложений КАК ИсторияКапвложений
	|ГДЕ
	|	ИсторияКапвложений.Период <= &Дата1
	|	И (&НетОтбораПоОрганизации
	|			ИЛИ ИсторияКапвложений.Организация В (&Организации))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабДвижений.Период КАК Период,
	|	&Активность КАК Активность,
	|	ТабДвижений.Организация КАК Организация,
	|	ТабДвижений.КарточкаКапвложений КАК КарточкаКапвложений,
	|	ТабДвижений.ОбъектВложений КАК ОбъектВложений,
	|	ТабДвижений.Подразделение КАК Подразделение,
	|	ТабДвижений.КФО КАК КФО,
	|	ТабДвижений.СчетВложения КАК СчетВложения,
	|	ТабДвижений.КПССчетВложения КАК КПССчетВложения,
	|	ТабДвижений.КЭКСчетВложения КАК КЭКСчетВложения,
	|	ТабДвижений.ЦМОСчетВложения КАК ЦМОСчетВложения,
	|	ТабДвижений.СчетКорр КАК СчетКорр,
	|	ТабДвижений.КПССчетКорр КАК КПССчетКорр,
	|	ТабДвижений.КЭКСчетКорр КАК КЭКСчетКорр,
	|	ТабДвижений.СубконтоСчетКорр1 КАК СубконтоСчетКорр1,
	|	ТабДвижений.СубконтоСчетКорр2 КАК СубконтоСчетКорр2,
	|	ТабДвижений.СубконтоСчетКорр3 КАК СубконтоСчетКорр3,
	|	ТабДвижений.ДатаОперации КАК ДатаОперации,
	|	ТабДвижений.СторонаСчетВложения КАК СторонаСчетВложения,
	|	ТабДвижений.Содержание КАК Содержание,
	|	ТабДвижений.ВидПервичногоДокумента КАК ВидПервичногоДокумента,
	|	ТабДвижений.ДатаПервичногоДокумента КАК ДатаПервичногоДокумента,
	|	ТабДвижений.НомерПервичногоДокумента КАК НомерПервичногоДокумента,
	|	ТабДвижений.ХарактеристикаДвиженияКорр КАК ХарактеристикаДвиженияКорр,
	|	ТабДвижений.Количество КАК Количество,
	|	ТабДвижений.Сумма КАК Сумма
	|ИЗ
	|	ТабДвижений КАК ТабДвижений
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТабДвижений.ОбъектВложений,
	|	ТабДвижений.КарточкаКапвложений,
	|	ТабДвижений.ДатаОперации";          
	
	Если СИтогамиДляСтаройСвертки Тогда
		ТекстЗапроса = ТекстЗапроса + "
			|	ИТОГИ ПО
			|		Организация,
			|		Активность";
	КонецЕсли;	
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	МассивОрганизаций = Новый Массив;
	НетОтбораПоОрганизации = Истина;
	Если ТипЗнч(Организации) = Тип("СправочникСсылка.Организации") И ЗначениеЗаполнено(Организации) Тогда              
		НетОтбораПоОрганизации = Ложь;
		МассивОрганизаций.Добавить(Организации);
	ИначеЕсли ТипЗнч(Организации) = Тип("Массив") И Организации.Количество() <> 0 Тогда              
		НетОтбораПоОрганизации = Ложь;
		МассивОрганизаций = Организации;
	КонецЕсли;	
	Запрос.УстановитьПараметр("Организации", МассивОрганизаций);
	Запрос.УстановитьПараметр("НетОтбораПоОрганизации", НетОтбораПоОрганизации);
	Запрос.УстановитьПараметр("Дата1", КонецДня(ДатаЗапроса));
	Запрос.УстановитьПараметр("Период", ДатаЗапроса);
	Запрос.УстановитьПараметр("СчетаКапвложений", ОбслуживаниеКарточекКапвложений.СчетаКапвложенийДляКарточкиКапвложений());
	Запрос.УстановитьПараметр("Активность", Истина);
	
	Возврат(Запрос);
КонецФункции	

// Формирует таблицу с данными карточек капвложений на дату. Таблица формируется по данным
// регистра бухгалтерии за вычетом движений, которые уже перенесены в регистр накопления "ИсторияКапвложений". 
//
// Параметры:
//	ДатаЗапроса - Дата
//	Организация - СправочникСсылка.Организации - элемент справочника "Организации" для отбора
//				- Массив Из СправочникСсылка.Организации - массив элементов справочника "Организации" для отбора
//
// Возвращаемое значение:
//	- ТаблицаЗначений - имена колонок полностью соотвествуют измерениям, ресурсам 
//						и реквизитам регистр накопления "ИсторияКапвложений"
Функция ТаблицаИсторииКапвложений(ДатаЗапроса, Организации = Неопределено) Экспорт
	Запрос = Запрос_ТаблицаИсторииКапвложений(ДатаЗапроса, Организации);
	
	Возврат(Запрос.Выполнить().Выгрузить());
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция формирует табличный документ Карточка истории капвложений
//
// Параметры: 
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ.
//
Функция ПечатьКарточкиИстории(МассивОбъектов, ОбъектыПечати)
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВводИсторииКапвложений.Ссылка КАК Ссылка,
	|	ВводИсторииКапвложений.Номер КАК НомерДокумента,
	|	ВводИсторииКапвложений.Дата КАК ДатаДокумента,
	|	ВводИсторииКапвложений.Организация КАК Организация,
	|	ВводИсторииКапвложений.ВидОперации КАК ВидОперации
	|ИЗ
	|	Документ.ВводИсторииКапвложений КАК ВводИсторииКапвложений
	|ГДЕ
	|	ВводИсторииКапвложений.Ссылка В(&МассивОбъектов)
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВводИсторииКапвложенийИсторияОпераций.Ссылка КАК Ссылка,
	|	ВводИсторииКапвложенийИсторияОпераций.ОбъектВложений КАК ОбъектВложений,
	|	ВводИсторииКапвложенийИсторияОпераций.КарточкаКапвложений КАК КарточкаКапвложений,
	|	ВводИсторииКапвложенийИсторияОпераций.Подразделение КАК Подразделение,
	|	ВводИсторииКапвложенийИсторияОпераций.КФО КАК КФО,
	|	ВЫБОР
	|		КОГДА ВводИсторииКапвложенийИсторияОпераций.СторонаСчетВложения = ""Дт""
	|			ТОГДА ВводИсторииКапвложенийИсторияОпераций.СчетВложения
	|		ИНАЧЕ ВводИсторииКапвложенийИсторияОпераций.СчетКорр
	|	КОНЕЦ КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ВводИсторииКапвложенийИсторияОпераций.СторонаСчетВложения = ""Дт""
	|			ТОГДА ВводИсторииКапвложенийИсторияОпераций.КПССчетВложения
	|		ИНАЧЕ ВводИсторииКапвложенийИсторияОпераций.КПССчетКорр
	|	КОНЕЦ КАК КПСДт,
	|	ВЫБОР
	|		КОГДА ВводИсторииКапвложенийИсторияОпераций.СторонаСчетВложения = ""Дт""
	|			ТОГДА ВводИсторииКапвложенийИсторияОпераций.КЭКСчетВложения
	|		ИНАЧЕ ВводИсторииКапвложенийИсторияОпераций.КЭКСчетКорр
	|	КОНЕЦ КАК КЭКДт,
	|	ВЫБОР
	|		КОГДА ВводИсторииКапвложенийИсторияОпераций.СторонаСчетВложения = ""Дт""
	|			ТОГДА """"
	|		ИНАЧЕ ВводИсторииКапвложенийИсторияОпераций.ХарактеристикаДвиженияКорр
	|	КОНЕЦ КАК ХарактеристикаДвиженияДт,
	|	ВЫБОР
	|		КОГДА ВводИсторииКапвложенийИсторияОпераций.СторонаСчетВложения = ""Дт""
	|			ТОГДА ВводИсторииКапвложенийИсторияОпераций.ОбъектВложений
	|		ИНАЧЕ ВводИсторииКапвложенийИсторияОпераций.СубконтоСчетКорр1
	|	КОНЕЦ КАК СубконтоДт1,
	|	ВЫБОР
	|		КОГДА ВводИсторииКапвложенийИсторияОпераций.СторонаСчетВложения = ""Дт""
	|			ТОГДА """"
	|		ИНАЧЕ ВводИсторииКапвложенийИсторияОпераций.СубконтоСчетКорр2
	|	КОНЕЦ КАК СубконтоДт2,
	|	ВЫБОР
	|		КОГДА ВводИсторииКапвложенийИсторияОпераций.СторонаСчетВложения = ""Дт""
	|			ТОГДА """"
	|		ИНАЧЕ ВводИсторииКапвложенийИсторияОпераций.СубконтоСчетКорр3
	|	КОНЕЦ КАК СубконтоДт3,
	|	ВЫБОР
	|		КОГДА ВводИсторииКапвложенийИсторияОпераций.СторонаСчетВложения = ""Кт""
	|			ТОГДА ВводИсторииКапвложенийИсторияОпераций.СчетВложения
	|		ИНАЧЕ ВводИсторииКапвложенийИсторияОпераций.СчетКорр
	|	КОНЕЦ КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ВводИсторииКапвложенийИсторияОпераций.СторонаСчетВложения = ""Кт""
	|			ТОГДА ВводИсторииКапвложенийИсторияОпераций.КПССчетВложения
	|		ИНАЧЕ ВводИсторииКапвложенийИсторияОпераций.КПССчетКорр
	|	КОНЕЦ КАК КПСКт,
	|	ВЫБОР
	|		КОГДА ВводИсторииКапвложенийИсторияОпераций.СторонаСчетВложения = ""Кт""
	|			ТОГДА ВводИсторииКапвложенийИсторияОпераций.КЭКСчетВложения
	|		ИНАЧЕ ВводИсторииКапвложенийИсторияОпераций.КЭКСчетКорр
	|	КОНЕЦ КАК КЭККт,
	|	ВЫБОР
	|		КОГДА ВводИсторииКапвложенийИсторияОпераций.СторонаСчетВложения = ""Кт""
	|			ТОГДА """"
	|		ИНАЧЕ ВводИсторииКапвложенийИсторияОпераций.ХарактеристикаДвиженияКорр
	|	КОНЕЦ КАК ХарактеристикаДвиженияКт,
	|	ВЫБОР
	|		КОГДА ВводИсторииКапвложенийИсторияОпераций.СторонаСчетВложения = ""Кт""
	|			ТОГДА ВводИсторииКапвложенийИсторияОпераций.ОбъектВложений
	|		ИНАЧЕ ВводИсторииКапвложенийИсторияОпераций.СубконтоСчетКорр1
	|	КОНЕЦ КАК СубконтоКт1,
	|	ВЫБОР
	|		КОГДА ВводИсторииКапвложенийИсторияОпераций.СторонаСчетВложения = ""Кт""
	|			ТОГДА """"
	|		ИНАЧЕ ВводИсторииКапвложенийИсторияОпераций.СубконтоСчетКорр2
	|	КОНЕЦ КАК СубконтоКт2,
	|	ВЫБОР
	|		КОГДА ВводИсторииКапвложенийИсторияОпераций.СторонаСчетВложения = ""Кт""
	|			ТОГДА """"
	|		ИНАЧЕ ВводИсторииКапвложенийИсторияОпераций.СубконтоСчетКорр3
	|	КОНЕЦ КАК СубконтоКт3,
	|	ВводИсторииКапвложенийИсторияОпераций.ДатаОперации КАК ДатаОперации,
	|	ВводИсторииКапвложенийИсторияОпераций.Содержание КАК Содержание,
	|	ВводИсторииКапвложенийИсторияОпераций.ВидПервичногоДокумента КАК ВидПервичногоДокумента,
	|	ВводИсторииКапвложенийИсторияОпераций.ДатаПервичногоДокумента КАК ДатаПервичногоДокумента,
	|	ВводИсторииКапвложенийИсторияОпераций.НомерПервичногоДокумента КАК НомерПервичногоДокумента,
	|	ВводИсторииКапвложенийИсторияОпераций.Количество КАК Количество,
	|	ВводИсторииКапвложенийИсторияОпераций.Сумма КАК Сумма
	|ИЗ
	|	Документ.ВводИсторииКапвложений.ИсторияОпераций КАК ВводИсторииКапвложенийИсторияОпераций
	|ГДЕ
	|	ВводИсторииКапвложенийИсторияОпераций.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВводИсторииКапвложенийИсторияОпераций.НомерСтроки,
	|	ВводИсторииКапвложенийИсторияОпераций.ДатаОперации
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	Ссылка,
	|	ОбъектВложений,
	|	КарточкаКапвложений";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Результат = Запрос.ВыполнитьПакет();
	Шапка = Результат[0].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТЧ    = Результат[1].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ТолькоПросмотр = Истина;
	
	Макет = ПолучитьМакет("ПФ_MXL_КарточкаДокументаИсторияКапвложений");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка     = Макет.ПолучитьОбласть("Шапка");
	ОбластьОбъектов  = Макет.ПолучитьОбласть("СтрокаОбъектов");
	ОбластьКарточек  = Макет.ПолучитьОбласть("СтрокаКарточек");
	ОбластьДетальная = Макет.ПолучитьОбласть("СтрокаДетальная");
	
	ВО_ПервоеПрименение = Перечисления.ВидыОперацийВводИсторииКапвложений.ВводКарточекКапвложенийПоОстаткам;
	КолонкаГруппировок = НСтр("ru = 'Объект /
		|Карточка /
		|Дата операции'");
	
	Для каждого СтрокаДокумента Из Шапка.Строки Цикл
		Если Шапка.Строки.Индекс(СтрокаДокумента) > 0 Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;	
		
		Для каждого СтрокаДетальная Из СтрокаДокумента.Строки Цикл
			ОбластьЗаголовок.Параметры.Заполнить(СтрокаДетальная);
			ТабДок.Вывести(ОбластьЗаголовок);
		КонецЦикла;	
		
		ОбластьШапка.Параметры.КолонкаГруппировок = КолонкаГруппировок;
		ТабДок.Вывести(ОбластьШапка);
		
		СтрокаТЧ = ТЧ.Строки.Найти(СтрокаДокумента.Ссылка, "Ссылка");
		Если СтрокаТЧ = Неопределено Тогда
			Продолжить;
		КонецЕсли;	   
		
		Для каждого СтрокаОбъекта Из СтрокаТЧ.Строки Цикл       
			ОбластьОбъектов.Параметры.Заполнить(СтрокаОбъекта);
			ТабДок.Вывести(ОбластьОбъектов);
			ТабДок.НачатьГруппуСтрок("ОбластьКарточек", Истина);
			
			Для каждого СтрокаКарточки Из СтрокаОбъекта.Строки Цикл
				ОбластьКарточек.Параметры.Заполнить(СтрокаКарточки);
				ТабДок.Вывести(ОбластьКарточек);
				
				ТабДок.НачатьГруппуСтрок("ОбластьДетальная", Истина);
				Для каждого СтрокаДетальная Из СтрокаКарточки.Строки Цикл
					ОбластьДетальная.Параметры.Заполнить(СтрокаДетальная);
					ТабДок.Вывести(ОбластьДетальная);
				КонецЦикла;	
				ТабДок.ЗакончитьГруппуСтрок();
			КонецЦикла;	
			ТабДок.ЗакончитьГруппуСтрок();
		КонецЦикла;	
	КонецЦикла;	
	
	Возврат ТабДок;
КонецФункции

Процедура ИнициализироватьЗапросПоДокументу(Запрос, НомераТаблиц)
	НомераТаблиц.Вставить("ИсторияКапвложений", НомераТаблиц.Количество());
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВводИсторииКапвложенийИсторияОпераций.Ссылка.Дата КАК Период,
	|	ВводИсторииКапвложенийИсторияОпераций.Ссылка.Организация КАК Организация,
	|	ВводИсторииКапвложенийИсторияОпераций.ОбъектВложений КАК ОбъектВложений,
	|	ВводИсторииКапвложенийИсторияОпераций.КарточкаКапвложений КАК КарточкаКапвложений,
	|	ВводИсторииКапвложенийИсторияОпераций.Количество КАК Количество,
	|	ВводИсторииКапвложенийИсторияОпераций.Сумма КАК Сумма,
	|	ВводИсторииКапвложенийИсторияОпераций.Подразделение КАК Подразделение,
	|	ВводИсторииКапвложенийИсторияОпераций.КФО КАК КФО,
	|	ВводИсторииКапвложенийИсторияОпераций.СчетВложения КАК СчетВложения,
	|	ВводИсторииКапвложенийИсторияОпераций.КПССчетВложения КАК КПССчетВложения,
	|	ВводИсторииКапвложенийИсторияОпераций.КЭКСчетВложения КАК КЭКСчетВложения,
	|	ВводИсторииКапвложенийИсторияОпераций.ЦМОСчетВложения КАК ЦМОСчетВложения,
	|	ВводИсторииКапвложенийИсторияОпераций.СчетКорр КАК СчетКорр,
	|	ВводИсторииКапвложенийИсторияОпераций.КПССчетКорр КАК КПССчетКорр,
	|	ВводИсторииКапвложенийИсторияОпераций.КЭКСчетКорр КАК КЭКСчетКорр,
	|	ВводИсторииКапвложенийИсторияОпераций.СубконтоСчетКорр1 КАК СубконтоСчетКорр1,
	|	ВводИсторииКапвложенийИсторияОпераций.СубконтоСчетКорр2 КАК СубконтоСчетКорр2,
	|	ВводИсторииКапвложенийИсторияОпераций.СубконтоСчетКорр3 КАК СубконтоСчетКорр3,
	|	ВводИсторииКапвложенийИсторияОпераций.ДатаОперации КАК ДатаОперации,
	|	ВводИсторииКапвложенийИсторияОпераций.СторонаСчетВложения КАК СторонаСчетВложения,
	|	ВводИсторииКапвложенийИсторияОпераций.Содержание КАК Содержание,
	|	ВводИсторииКапвложенийИсторияОпераций.ВидПервичногоДокумента КАК ВидПервичногоДокумента,
	|	ВводИсторииКапвложенийИсторияОпераций.ДатаПервичногоДокумента КАК ДатаПервичногоДокумента,
	|	ВводИсторииКапвложенийИсторияОпераций.НомерПервичногоДокумента КАК НомерПервичногоДокумента,
	|	ВводИсторииКапвложенийИсторияОпераций.ХарактеристикаДвиженияКорр КАК ХарактеристикаДвиженияКорр
	|ИЗ
	|	Документ.ВводИсторииКапвложений.ИсторияОпераций КАК ВводИсторииКапвложенийИсторияОпераций
	|ГДЕ
	|	ВводИсторииКапвложенийИсторияОпераций.Ссылка = &Ссылка";
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
